# ReynoldsNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..ReynoldsNumber Property
MEPSection Class See Also
---
The Reynolds number of the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ReynoldsNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ReynoldsNumber As Double
	Get
```

Visual C++
---
```text
public:
property double ReynoldsNumber {
	double get ();
}
```

# Remarks
Reynolds number is a number. The Reynolds number type is UT_Number.
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace